In [1]:
# Import thư viện cần thiết
import sqlite3
import pandas as pd

# Kết nối đến SQLite (trong bộ nhớ)
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Tạo bảng course
cursor.execute("""
CREATE TABLE course (
    id INTEGER PRIMARY KEY,
    course_name TEXT
)
""")

# Thêm dữ liệu vào bảng course
courses = [(12, "Giai tich"), (34, "Thong ke"), (26, "Tin hoc")]
cursor.executemany("INSERT INTO course (id, course_name) VALUES (?, ?)", courses)

# Tạo bảng student
cursor.execute("""
CREATE TABLE student (
    student_id INTEGER PRIMARY KEY,
    name TEXT,
    class TEXT,
    course_id INTEGER,
    score REAL
)
""")

# Thêm dữ liệu vào bảng student
students = [
    (1, "Nguyen Minh Hoang", "May Tinh", 12, 6.7),
    (2, "Tran Thi Lan", "Kinh Te", 34, 9.2),
    (3, "Pham Van Nam", "Toan Tin", None, 7.9),
    (4, "Le Thanh Huyen", "Toan Tin", 20, 7.2),
    (5, "Vu Quoc Anh", "May Tinh", 24, 8.0),
    (6, "Dang Thuy Linh", "May Tinh", 24, 5.5),
    (7, "Bui Tien Dung", "Kinh Te", 34, 9.2),
    (8, "Ho Ngoc Mai", "Toan Tin", 20, 8.8),
    (9, "Duong Huu Phuc", "Kinh Te", None, 7.2),
    (10, "Cao Thi Hanh", "May Tinh", None, 7.0),
]

cursor.executemany("INSERT INTO student (student_id, name, class, course_id, score) VALUES (?, ?, ?, ?, ?)", students)

# Hiển thị dữ liệu bảng student
df_students = pd.read_sql_query("SELECT * FROM student", conn)
print("Bảng STUDENT:")
print(df_students)

# Hiển thị dữ liệu bảng course
df_courses = pd.read_sql_query("SELECT * FROM course", conn)
print("\nBảng COURSE:")
print(df_courses)

Bảng STUDENT:
   student_id               name     class  course_id  score
0           1  Nguyen Minh Hoang  May Tinh       12.0    6.7
1           2       Tran Thi Lan   Kinh Te       34.0    9.2
2           3       Pham Van Nam  Toan Tin        NaN    7.9
3           4     Le Thanh Huyen  Toan Tin       20.0    7.2
4           5        Vu Quoc Anh  May Tinh       24.0    8.0
5           6     Dang Thuy Linh  May Tinh       24.0    5.5
6           7      Bui Tien Dung   Kinh Te       34.0    9.2
7           8        Ho Ngoc Mai  Toan Tin       20.0    8.8
8           9     Duong Huu Phuc   Kinh Te        NaN    7.2
9          10       Cao Thi Hanh  May Tinh        NaN    7.0

Bảng COURSE:
   id course_name
0  12   Giai tich
1  26     Tin hoc
2  34    Thong ke

# câu 1:

In [2]:
# Thực hiện tích Descartes (Cross Join)
df_cross_join = pd.read_sql_query("""
SELECT * FROM student, course
""", conn)

# In kết quả
print("Tích Descartes giữa student và course:")
print(df_cross_join.head(10))  # Hiển thị 10 dòng đầu tiên

Tích Descartes giữa student và course:
   student_id               name     class  course_id  score  id course_name
0           1  Nguyen Minh Hoang  May Tinh       12.0    6.7  12   Giai tich
1           1  Nguyen Minh Hoang  May Tinh       12.0    6.7  26     Tin hoc
2           1  Nguyen Minh Hoang  May Tinh       12.0    6.7  34    Thong ke
3           2       Tran Thi Lan   Kinh Te       34.0    9.2  12   Giai tich
4           2       Tran Thi Lan   Kinh Te       34.0    9.2  26     Tin hoc
5           2       Tran Thi Lan   Kinh Te       34.0    9.2  34    Thong ke
6           3       Pham Van Nam  Toan Tin        NaN    7.9  12   Giai tich
7           3       Pham Van Nam  Toan Tin        NaN    7.9  26     Tin hoc
8           3       Pham Van Nam  Toan Tin        NaN    7.9  34    Thong ke
9           4     Le Thanh Huyen  Toan Tin       20.0    7.2  12   Giai tich

In [3]:
# Thực hiện INNER JOIN
df_inner_join = pd.read_sql_query("""
SELECT student.*, course.course_name
FROM student
INNER JOIN course
ON student.course_id = course.id
""", conn)

# In kết quả
print("Kết quả INNER JOIN giữa student và course:")
print(df_inner_join)

Kết quả INNER JOIN giữa student và course:
   student_id               name     class  course_id  score course_name
0           1  Nguyen Minh Hoang  May Tinh         12    6.7   Giai tich
1           2       Tran Thi Lan   Kinh Te         34    9.2    Thong ke
2           7      Bui Tien Dung   Kinh Te         34    9.2    Thong ke

In [4]:

# Thực hiện LEFT JOIN
df_left_join = pd.read_sql_query("""
SELECT student.*, course.course_name
FROM student
LEFT JOIN course
ON student.course_id = course.id
""", conn)

# In kết quả
print("Kết quả LEFT JOIN giữa student và course:")
print(df_left_join)

Kết quả LEFT JOIN giữa student và course:
   student_id               name     class  course_id  score course_name
0           1  Nguyen Minh Hoang  May Tinh       12.0    6.7   Giai tich
1           2       Tran Thi Lan   Kinh Te       34.0    9.2    Thong ke
2           3       Pham Van Nam  Toan Tin        NaN    7.9        None
3           4     Le Thanh Huyen  Toan Tin       20.0    7.2        None
4           5        Vu Quoc Anh  May Tinh       24.0    8.0        None
5           6     Dang Thuy Linh  May Tinh       24.0    5.5        None
6           7      Bui Tien Dung   Kinh Te       34.0    9.2    Thong ke
7           8        Ho Ngoc Mai  Toan Tin       20.0    8.8        None
8           9     Duong Huu Phuc   Kinh Te        NaN    7.2        None
9          10       Cao Thi Hanh  May Tinh        NaN    7.0        None

In [5]:
# RIGHT JOIN không hỗ trợ trong SQLite, giả lập bằng cách đảo ngược LEFT JOIN
df_right_join = pd.read_sql_query("""
SELECT student.*, course.course_name
FROM course
LEFT JOIN student
ON student.course_id = course.id
""", conn)

# In kết quả
print("Kết quả RIGHT JOIN giữa student và course:")
print(df_right_join)

Kết quả RIGHT JOIN giữa student và course:
   student_id               name     class  course_id  score course_name
0         1.0  Nguyen Minh Hoang  May Tinh       12.0    6.7   Giai tich
1         NaN               None      None        NaN    NaN     Tin hoc
2         7.0      Bui Tien Dung   Kinh Te       34.0    9.2    Thong ke
3         2.0       Tran Thi Lan   Kinh Te       34.0    9.2    Thong ke

In [6]:
# FULL OUTER JOIN không hỗ trợ trong SQLite, giả lập bằng UNION của LEFT JOIN và RIGHT JOIN
df_full_outer_join = pd.read_sql_query("""
SELECT student.*, course.course_name
FROM student
LEFT JOIN course
ON student.course_id = course.id

UNION

SELECT student.*, course.course_name
FROM course
LEFT JOIN student
ON student.course_id = course.id
""", conn)

# In kết quả
print("Kết quả FULL OUTER JOIN giữa student và course:")
print(df_full_outer_join)

Kết quả FULL OUTER JOIN giữa student và course:
    student_id               name     class  course_id  score course_name
0          NaN               None      None        NaN    NaN     Tin hoc
1          1.0  Nguyen Minh Hoang  May Tinh       12.0    6.7   Giai tich
2          2.0       Tran Thi Lan   Kinh Te       34.0    9.2    Thong ke
3          3.0       Pham Van Nam  Toan Tin        NaN    7.9        None
4          4.0     Le Thanh Huyen  Toan Tin       20.0    7.2        None
5          5.0        Vu Quoc Anh  May Tinh       24.0    8.0        None
6          6.0     Dang Thuy Linh  May Tinh       24.0    5.5        None
7          7.0      Bui Tien Dung   Kinh Te       34.0    9.2    Thong ke
8          8.0        Ho Ngoc Mai  Toan Tin       20.0    8.8        None
9          9.0     Duong Huu Phuc   Kinh Te        NaN    7.2        None
10        10.0       Cao Thi Hanh  May Tinh        NaN    7.0        None

# câu 2:

In [7]:
# Cập nhật course_id còn thiếu bằng giá trị hợp lệ từ bảng course
cursor.execute("""
UPDATE student
SET course_id = (SELECT id FROM course ORDER BY RANDOM() LIMIT 1)
WHERE course_id IS NULL
""")

# Xóa những sinh viên có course_id không tồn tại trong bảng course
cursor.execute("""
DELETE FROM student
WHERE course_id NOT IN (SELECT id FROM course)
""")

# In lại bảng student sau khi cập nhật
df_updated_students = pd.read_sql_query("SELECT * FROM student", conn)
print("Bảng STUDENT sau khi cập nhật course_id:")
print(df_updated_students)

Bảng STUDENT sau khi cập nhật course_id:
   student_id               name     class  course_id  score
0           1  Nguyen Minh Hoang  May Tinh         12    6.7
1           2       Tran Thi Lan   Kinh Te         34    9.2
2           3       Pham Van Nam  Toan Tin         26    7.9
3           7      Bui Tien Dung   Kinh Te         34    9.2
4           9     Duong Huu Phuc   Kinh Te         26    7.2
5          10       Cao Thi Hanh  May Tinh         26    7.0

In [8]:
# Tính tổng số sinh viên và điểm trung bình theo từng lớp
df_class_avg = pd.read_sql_query("""
SELECT class, COUNT(student_id) AS total_students, AVG(score) AS avg_score
FROM student
GROUP BY class
""", conn)

# In kết quả
print("Tổng số sinh viên và điểm trung bình theo từng lớp:")
print(df_class_avg)

Tổng số sinh viên và điểm trung bình theo từng lớp:
      class  total_students  avg_score
0   Kinh Te               3   8.533333
1  May Tinh               2   6.850000
2  Toan Tin               1   7.900000

In [9]:
# Tính tổng số sinh viên và điểm trung bình theo từng môn học
df_course_avg = pd.read_sql_query("""
SELECT course.course_name, COUNT(student.student_id) AS total_students, AVG(student.score) AS avg_score
FROM student
JOIN course ON student.course_id = course.id
GROUP BY course.course_name
""", conn)

# In kết quả
print("Tổng số sinh viên và điểm trung bình theo từng môn học:")
print(df_course_avg)

Tổng số sinh viên và điểm trung bình theo từng môn học:
  course_name  total_students  avg_score
0   Giai tich               1   6.700000
1    Thong ke               2   9.200000
2     Tin hoc               3   7.366667

In [10]:
# Tính điểm trung bình của từng môn học và phân loại thi đua
df_course_avg = pd.read_sql_query("""
SELECT course.course_name,
       COUNT(student.student_id) AS total_students,
       AVG(student.score) AS avg_score
FROM student
JOIN course ON student.course_id = course.id
GROUP BY course.course_name
""", conn)

# Thêm cột phân loại thi đua
df_course_avg["classification"] = df_course_avg["avg_score"].apply(
    lambda x: "Xuất sắc" if x >= 9.0 else "Tốt" if x >= 6.0 else "Kém"
)

# In kết quả
print("Phân loại thi đua theo điểm trung bình từng môn học:")
print(df_course_avg)

Phân loại thi đua theo điểm trung bình từng môn học:
  course_name  total_students  avg_score classification
0   Giai tich               1   6.700000            Tốt
1    Thong ke               2   9.200000       Xuất sắc
2     Tin hoc               3   7.366667            Tốt

# câu 3

In [11]:
# Xếp hạng sinh viên theo điểm số chung
df_rank_overall = pd.read_sql_query("""
SELECT student_id, name, class, course_id, score,
       RANK() OVER (ORDER BY score DESC) AS rank_overall
FROM student
""", conn)
print("Xếp hạng sinh viên theo điểm số chung:")
print(df_rank_overall)

# Xếp hạng sinh viên theo lớp học
df_rank_class = pd.read_sql_query("""
SELECT student_id, name, class, course_id, score,
       RANK() OVER (PARTITION BY class ORDER BY score DESC) AS rank_class
FROM student
""", conn)
print("\nXếp hạng sinh viên theo điểm số trong lớp:")
print(df_rank_class)

# Xếp hạng sinh viên theo môn học
df_rank_course = pd.read_sql_query("""
SELECT student_id, name, class, course_id, score,
       RANK() OVER (PARTITION BY course_id ORDER BY score DESC) AS rank_course
FROM student
""", conn)
print("\nXếp hạng sinh viên theo điểm số theo môn học:")
print(df_rank_course)

# Lấy top 3 sinh viên cao nhất & thấp nhất theo từng tiêu chí
print("\nTop 3 sinh viên có điểm cao nhất:")
print(df_rank_overall.head(3))

print("\nTop 3 sinh viên có điểm thấp nhất:")
print(df_rank_overall.tail(3))

Xếp hạng sinh viên theo điểm số chung:
   student_id               name     class  course_id  score  rank_overall
0           2       Tran Thi Lan   Kinh Te         34    9.2             1
1           7      Bui Tien Dung   Kinh Te         34    9.2             1
2           3       Pham Van Nam  Toan Tin         26    7.9             3
3           9     Duong Huu Phuc   Kinh Te         26    7.2             4
4          10       Cao Thi Hanh  May Tinh         26    7.0             5
5           1  Nguyen Minh Hoang  May Tinh         12    6.7             6

Xếp hạng sinh viên theo điểm số trong lớp:
   student_id               name     class  course_id  score  rank_class
0           2       Tran Thi Lan   Kinh Te         34    9.2           1
1           7      Bui Tien Dung   Kinh Te         34    9.2           1
2           9     Duong Huu Phuc   Kinh Te         26    7.2           3
3          10       Cao Thi Hanh  May Tinh         26    7.0           1
4           1  Nguyen Minh Hoang  May Tinh         12    6.7           2
5           3       Pham Van Nam  Toan Tin         26    7.9           1

Xếp hạng sinh viên theo điểm số theo môn học:
   student_id               name     class  course_id  score  rank_course
0           1  Nguyen Minh Hoang  May Tinh         12    6.7            1
1           3       Pham Van Nam  Toan Tin         26    7.9            1
2           9     Duong Huu Phuc   Kinh Te         26    7.2            2
3          10       Cao Thi Hanh  May Tinh         26    7.0            3
4           2       Tran Thi Lan   Kinh Te         34    9.2            1
5           7      Bui Tien Dung   Kinh Te         34    9.2            1

Top 3 sinh viên có điểm cao nhất:
   student_id           name     class  course_id  score  rank_overall
0           2   Tran Thi Lan   Kinh Te         34    9.2             1
1           7  Bui Tien Dung   Kinh Te         34    9.2             1
2           3   Pham Van Nam  Toan Tin         26    7.9             3

Top 3 sinh viên có điểm thấp nhất:
   student_id               name     class  course_id  score  rank_overall
3           9     Duong Huu Phuc   Kinh Te         26    7.2             4
4          10       Cao Thi Hanh  May Tinh         26    7.0             5
5           1  Nguyen Minh Hoang  May Tinh         12    6.7             6

# Câu 4

In [12]:
# Thêm cột graduation_date vào bảng student
cursor.execute("ALTER TABLE student ADD COLUMN graduation_date DATETIME")

# Cập nhật thời gian tốt nghiệp dựa vào điểm số
cursor.execute("""
UPDATE student
SET graduation_date = datetime('now', '+' || CAST((10 - score) AS INTEGER) || ' months')
""")

# Hiển thị dữ liệu student sau khi cập nhật ngày tốt nghiệp
df_updated_students = pd.read_sql_query("SELECT * FROM student", conn)
print("Bảng STUDENT sau khi thêm graduation_date:")
print(df_updated_students)

Bảng STUDENT sau khi thêm graduation_date:
   student_id               name     class  course_id  score  \
0           1  Nguyen Minh Hoang  May Tinh         12    6.7
1           2       Tran Thi Lan   Kinh Te         34    9.2
2           3       Pham Van Nam  Toan Tin         26    7.9
3           7      Bui Tien Dung   Kinh Te         34    9.2
4           9     Duong Huu Phuc   Kinh Te         26    7.2
5          10       Cao Thi Hanh  May Tinh         26    7.0

       graduation_date
0  2025-06-08 03:29:43
1  2025-03-08 03:29:43
2  2025-05-08 03:29:43
3  2025-03-08 03:29:43
4  2025-05-08 03:29:43
5  2025-06-08 03:29:43